rails_app/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("username", "age") VALUES ($1, $2) RETURNING "id"  [["username", "me"], ["age", 3]]